{"keras_version": "1.0.5", "optimizer": {"epsilon": 1e-08, "name": "Adadelta", "lr": 1.0, "rho": 0.95}, "sample_weight_mode": null, "class_name": "Model", "loss_weights": null, "loss": "categorical_crossentropy", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1, 9, 9], "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_3", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 1, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_1", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 1, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_4", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"border_mode": "same", "strides": [1, 1], "trainable": true, "name": "maxpooling2d_1", "pool_size": [3, 3], "dim_ordering": "th"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_2", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_5", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_6", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 1, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"activity_regularizer": null, "bias": true, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_7", "nb_filter": 16, "init": "glorot_uniform", "W_constraint": null, "nb_col": 1, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "mode_type": "raw", "name": "merge_1", "output_shape": null, "concat_axis": 1}, "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["input_1", 0, 0]]]}, {"class_name": "SReLU", "name": "srelu_1", "config": {"a_left_init": "glorot_uniform", "t_left_init": "zero", "trainable": true, "name": "srelu_1", "a_right_init": "one", "t_right_init": "glorot_uniform"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"activity_regularizer": null, "bias": true, "border_mode": "valid", "activation": "linear", "trainable": true, "name": "convolution2d_8", "nb_filter": 32, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["srelu_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"border_mode": "valid", "strides": [3, 3], "trainable": true, "name": "maxpooling2d_2", "pool_size": [3, 3], "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "input_dim": null, "activation": "relu", "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "input_dim": null, "activation": "relu", "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "output_dim": 256, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_2"}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"activity_regularizer": null, "input_dim": null, "activation": "softmax", "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "output_dim": 81, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "name": "dense_3"}, "inbound_nodes": [[["dropout_1", 0, 0]]]}]}}