{"loss_weights": null, "sample_weight_mode": null, "class_name": "Model", "loss": "categorical_crossentropy", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 9, 9], "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 1, "name": "convolution2d_3", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 1, "name": "convolution2d_1", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 3, "name": "convolution2d_4", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"strides": [1, 1], "border_mode": "same", "name": "maxpooling2d_1", "pool_size": [3, 3], "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 3, "name": "convolution2d_2", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 3, "name": "convolution2d_5", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 1, "name": "convolution2d_6", "subsample": [1, 1], "nb_filter": 32, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 1, "name": "convolution2d_7", "subsample": [1, 1], "nb_filter": 16, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 1, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"dot_axes": [-1, -1], "output_shape_type": "raw", "mode_type": "raw", "mode": "concat", "name": "merge_1", "output_shape": null, "concat_axis": 1}, "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["input_1", 0, 0]]]}, {"name": "srelu_1", "class_name": "SReLU", "config": {"a_right_init": "one", "t_left_init": "zero", "name": "srelu_1", "t_right_init": "glorot_uniform", "a_left_init": "glorot_uniform", "trainable": true}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "nb_col": 3, "name": "convolution2d_8", "subsample": [1, 1], "nb_filter": 32, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["srelu_1", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"strides": [3, 3], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [3, 3], "trainable": true, "dim_ordering": "th"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias": true, "W_constraint": null, "input_dim": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "W_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias": true, "W_constraint": null, "input_dim": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "output_dim": 256, "activity_regularizer": null, "W_regularizer": null, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias": true, "W_constraint": null, "input_dim": null, "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "output_dim": 81, "activity_regularizer": null, "W_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0]]]}], "output_layers": [["dense_3", 0, 0]]}, "optimizer": {"lr": 1.0, "name": "Adadelta", "rho": 0.95, "epsilon": 1e-08}, "keras_version": "1.0.5"}