{"optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "loss": "categorical_crossentropy", "loss_weights": null, "sample_weight_mode": null, "class_name": "Model", "keras_version": "1.0.5", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 1, 9, 9], "name": "input_1", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_3", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_3", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_1", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_4", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "maxpooling2d_1", "config": {"dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_2", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "convolution2d_5", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_5", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_6", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_6", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_7", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_7", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Merge", "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["input_1", 0, 0]]], "name": "merge_1", "config": {"output_shape": null, "output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "mode_type": "raw", "concat_axis": 1, "name": "merge_1"}}, {"class_name": "SReLU", "inbound_nodes": [[["merge_1", 0, 0]]], "name": "srelu_1", "config": {"a_left_init": "glorot_uniform", "t_left_init": "zero", "t_right_init": "glorot_uniform", "name": "srelu_1", "a_right_init": "one", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_1", 0, 0]]], "name": "convolution2d_10", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_10", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "convolution2d_11", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_11", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_1", 0, 0]]], "name": "convolution2d_8", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_8", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["srelu_1", 0, 0]]], "name": "maxpooling2d_2", "config": {"dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "convolution2d_12", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_12", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_13", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_13", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_1", 0, 0]]], "name": "convolution2d_14", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_14", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "convolution2d_9", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_9", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Merge", "inbound_nodes": [[["convolution2d_9", 0, 0], ["convolution2d_12", 0, 0], ["convolution2d_13", 0, 0], ["convolution2d_14", 0, 0], ["srelu_1", 0, 0]]], "name": "merge_2", "config": {"output_shape": null, "output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "mode_type": "raw", "concat_axis": 1, "name": "merge_2"}}, {"class_name": "SReLU", "inbound_nodes": [[["merge_2", 0, 0]]], "name": "srelu_2", "config": {"a_left_init": "glorot_uniform", "t_left_init": "zero", "t_right_init": "glorot_uniform", "name": "srelu_2", "a_right_init": "one", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_2", 0, 0]]], "name": "convolution2d_17", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_17", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_2", 0, 0]]], "name": "convolution2d_15", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_15", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "convolution2d_18", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_18", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["srelu_2", 0, 0]]], "name": "maxpooling2d_3", "config": {"dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same", "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "convolution2d_16", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_16", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "convolution2d_19", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_19", "trainable": true, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "convolution2d_20", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_20", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["srelu_2", 0, 0]]], "name": "convolution2d_21", "config": {"init": "glorot_uniform", "bias": true, "border_mode": "same", "b_constraint": null, "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_21", "trainable": true, "dim_ordering": "th", "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "subsample": [1, 1]}}, {"class_name": "Merge", "inbound_nodes": [[["convolution2d_16", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0], ["srelu_2", 0, 0]]], "name": "merge_3", "config": {"output_shape": null, "output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "mode_type": "raw", "concat_axis": 1, "name": "merge_3"}}, {"class_name": "SReLU", "inbound_nodes": [[["merge_3", 0, 0]]], "name": "srelu_3", "config": {"a_left_init": "glorot_uniform", "t_left_init": "zero", "t_right_init": "glorot_uniform", "name": "srelu_3", "a_right_init": "one", "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["srelu_3", 0, 0]]], "name": "maxpooling2d_4", "config": {"dim_ordering": "th", "pool_size": [3, 3], "strides": [3, 3], "border_mode": "valid", "name": "maxpooling2d_4", "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"init": "glorot_uniform", "bias": true, "output_dim": 512, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": null, "W_constraint": null, "name": "dense_1", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "config": {"init": "glorot_uniform", "bias": true, "output_dim": 256, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": null, "W_constraint": null, "name": "dense_2", "trainable": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_1", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_3", "config": {"init": "glorot_uniform", "bias": true, "output_dim": 81, "activity_regularizer": null, "b_constraint": null, "activation": "softmax", "input_dim": null, "W_constraint": null, "name": "dense_3", "trainable": true, "b_regularizer": null, "W_regularizer": null}}], "name": "model_1", "output_layers": [["dense_3", 0, 0]]}}