{"keras_version": "1.1.2", "config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 9, 9], "name": "input_1"}, "class_name": "InputLayer"}, {"name": "convolution2d_3", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 1, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 1, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 1, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 1, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"name": "convolution2d_4", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 3, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"dim_ordering": "th", "border_mode": "same", "trainable": true, "name": "maxpooling2d_1", "strides": [1, 1], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"name": "convolution2d_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 3, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"name": "convolution2d_5", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 3, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"name": "convolution2d_6", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 1, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 1, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_6"}, "class_name": "Convolution2D"}, {"name": "convolution2d_7", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 1, "border_mode": "same", "activation": "linear", "W_regularizer": null, "nb_col": 1, "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "name": "convolution2d_7"}, "class_name": "Convolution2D"}, {"name": "merge_1", "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["input_1", 0, 0]]], "config": {"mode": "concat", "name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_shape": null, "output_mask": null, "output_shape_type": "raw", "arguments": {}, "output_mask_type": "raw"}, "class_name": "Merge"}, {"name": "srelu_1", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"a_left_init": "glorot_uniform", "t_right_init": "glorot_uniform", "a_right_init": "one", "name": "srelu_1", "t_left_init": "zero", "trainable": true}, "class_name": "SReLU"}, {"name": "convolution2d_8", "inbound_nodes": [[["srelu_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "th", "nb_row": 3, "border_mode": "valid", "activation": "linear", "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "name": "convolution2d_8"}, "class_name": "Convolution2D"}, {"name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"dim_ordering": "th", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"name": "flatten_1", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"init": "glorot_uniform", "output_dim": 512, "b_constraint": null, "name": "dense_1", "W_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"init": "glorot_uniform", "output_dim": 256, "b_constraint": null, "name": "dense_2", "W_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"name": "dropout_1", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"init": "glorot_uniform", "output_dim": 81, "b_constraint": null, "name": "dense_3", "W_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Model"}