{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 1, 9, 9], "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 1, "nb_row": 1, "name": "convolution2d_3", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 1, "nb_row": 1, "name": "convolution2d_1", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "name": "convolution2d_4", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"border_mode": "same", "trainable": true, "strides": [1, 1], "name": "maxpooling2d_1", "dim_ordering": "th", "pool_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "name": "convolution2d_2", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "name": "convolution2d_5", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 1, "nb_row": 1, "name": "convolution2d_6", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"border_mode": "same", "b_regularizer": null, "trainable": true, "nb_col": 1, "nb_row": 1, "name": "convolution2d_7", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 16, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"mode": "concat", "output_shape": null, "concat_axis": 1, "output_shape_type": "raw", "output_mask_type": "raw", "arguments": {}, "dot_axes": -1, "name": "merge_1", "mode_type": "raw", "output_mask": null}, "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["input_1", 0, 0]]]}, {"class_name": "SReLU", "name": "srelu_1", "config": {"trainable": true, "t_left_init": "zero", "name": "srelu_1", "a_left_init": "glorot_uniform", "a_right_init": "one", "t_right_init": "glorot_uniform"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"border_mode": "valid", "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "name": "convolution2d_8", "activation": "linear", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["srelu_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"border_mode": "valid", "trainable": true, "strides": [3, 3], "name": "maxpooling2d_2", "dim_ordering": "th", "pool_size": [3, 3]}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"b_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "input_dim": null, "output_dim": 512, "W_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"b_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "input_dim": null, "output_dim": 256, "W_constraint": null, "bias": true, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"b_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "input_dim": null, "output_dim": 81, "W_constraint": null, "bias": true, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}], "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}