{"keras_version": "1.1.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"input_dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 1, 9, 9]}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 32, "trainable": true, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "bias": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "dim_ordering": "th"}}, {"name": "srelu_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "SReLU", "config": {"trainable": true, "name": "srelu_1", "t_left_init": "zero", "t_right_init": "glorot_uniform", "a_left_init": "glorot_uniform", "a_right_init": "one"}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["srelu_1", 0, 0]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "th", "strides": [3, 3], "pool_size": [3, 3]}}, {"name": "flatten_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "name": "dense_1", "activation": "relu", "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "b_regularizer": null}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 256, "trainable": true, "name": "dense_2", "activation": "relu", "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "b_regularizer": null}}, {"name": "dropout_1", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 81, "trainable": true, "name": "dense_3", "activation": "softmax", "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "b_regularizer": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}